README.md

# Table of Contents

1.  [BackToTheDrawingBoard](#org48fe9de)
2.  [Goals](#org26a5d45)
3.  [Related Repos](#orgb762e3e)
4.  [Demo](#orgfaa8828)
5.  [References](#org950fc6a)


<a id="org48fe9de"></a>

# BackToTheDrawingBoard

70's and 80's inspired comic book artist style drawing board web app that allows you to upload images to use as image references for creating art


<a id="org26a5d45"></a>

# Goals

The main goals of this project include the following:

-   Uploading art reference images
-   Resizing images


<a id="orgb762e3e"></a>

# Related Repos

The project's main repo exists here:

-   <https://github.com/SamuelBanya/BackToTheDrawingBoard>

The project's 'json-server' backend repo that runs on a related Heroku instance can be found here:

-   <https://github.com/SamuelBanya/BackToTheDrawingBoardJsonServer>


<a id="orgfaa8828"></a>

# Demo

This project is live on a Netlify related instance here:

-   <https://backtothedrawingboard.netlify.app/board>

Its 'json-server' backend can be found on a Heroku instance here:

-   <https://drawingboardjsonserver.herokuapp.com/>


<a id="org950fc6a"></a>

# References

Here are there references I utilized while making this project:

-   This app was used for the idea to utilize both 'Draggable' and 'Re-resizable' components to achieve the goals I had for this particular project:
-   <https://stackblitz.com/edit/react-draggable-and-resizable-pictures?file=index.js>
-   Example of using 'Draggable' with a 'Function' React component:
-   <https://blog.logrocket.com/create-draggable-components-react-draggable/>
-   Example of using 're-resizable' with a 'Function' React component:
-   <https://www.tutorialspoint.com/how-to-make-a-resizable-element-in-react-js>
